data/WS-Addressing/ws-addressing-39.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s12/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:2f51d506-7c60-4cb7-8986-8ba83ff64fd1</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address><ReferenceParameters xmlns:customer="http://example.org/customer" customer:level="premium"><customer:CustomerKey>Key#123456789</customer:CustomerKey></ReferenceParameters><Metadata xmlns:customer="http://example.org/customer" customer:total="1"></Metadata><customer:Metadata xmlns:customer="http://example.org/customer"><customer:extraStuff>This should be ignored</customer:extraStuff></customer:Metadata></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1208</notify></S:Body></S:Envelope>